FemDesign.Reinforcement.PtcShapeInner.Position
x'

FemDesign.Reinforcement.PtcShapeInner.Z
z'

FemDesign.Reinforcement.PtcShapeInner.NormalizedInflectionPosition
Internal property to reflect whether or not the PriorInflectionPosition is been normalized along the parent element or not.
true: FemDesign.Reinforcement.PtcShapeInner.PriorInflectionPosition is normalized (0-1) along parant element.
false: FemDesign.Reinforcement.PtcShapeInner.PriorInflectionPosition is normalized (0-1) between prior and next basepoints.
When serializing to struxml this shold have been set to false by FemDesign.Reinforcement.PtcShapeType.DenormalizePriorInflectionParameters(FemDesign.Reinforcement.PtcShapeEnd@,System.Collections.Generic.IEnumerable{FemDesign.Reinforcement.PtcShapeInner}@).

FemDesign.Reinforcement.PtcShapeInner.#ctor
Parameterless constructor for serialization

FemDesign.Reinforcement.PtcShapeInner.#ctor(System.Double,System.Double,System.Double,System.Nullable{System.Double})
x: Parameter along axis of element.
z: Height
tangent: Tangent of cable at the inner point
priorInflectionPosition: Parameter of prior inflection point, if any. Optional